Projects/Join_Typ/output/logs/varchar_queries_length/varchar_queries_length_select_sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 8
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 8 tps: 369.02 qps: 369.02 (r/w/o: 369.02/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 8 tps: 374.55 qps: 374.55 (r/w/o: 374.55/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 8 tps: 375.01 qps: 375.01 (r/w/o: 375.01/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 8 tps: 375.09 qps: 375.09 (r/w/o: 375.09/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 373.28 qps: 373.28 (r/w/o: 373.28/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 8 tps: 374.56 qps: 374.56 (r/w/o: 374.56/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 8 tps: 373.09 qps: 373.09 (r/w/o: 373.09/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            7852
        write:                           0
        other:                           0
        total:                           7852
    transactions:                        7852   (373.55 per sec.)
    queries:                             7852   (373.55 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          21.0196s
    total number of events:              7852

Latency (ms):
         min:                                   17.36
         avg:                                   21.40
         max:                                   61.36
         95th percentile:                        0.00
         sum:                               168059.15

Threads fairness:
    events (avg/stddev):           981.5000/2.69
    execution time (avg/stddev):   21.0074/0.01