Projects/Join_Typ/output/logs/varchar_queries_length/varchar_queries_length_select_sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1725453128)

Running the test with following options:
Number of threads: 8
Report intermediate results every 3 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 3s ] thds: 8 tps: 377.96 qps: 377.96 (r/w/o: 377.96/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 8 tps: 384.84 qps: 384.84 (r/w/o: 384.84/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 8 tps: 383.53 qps: 383.53 (r/w/o: 383.53/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 8 tps: 384.67 qps: 384.67 (r/w/o: 384.67/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 384.15 qps: 384.15 (r/w/o: 384.15/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 8 tps: 384.91 qps: 384.91 (r/w/o: 384.91/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 8 tps: 383.27 qps: 383.27 (r/w/o: 383.27/0.00/0.00) lat (ms,95%): 0.00 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            8059
        write:                           0
        other:                           0
        total:                           8059
    transactions:                        8059   (383.38 per sec.)
    queries:                             8059   (383.38 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          21.0207s
    total number of events:              8059

Latency (ms):
         min:                                   17.19
         avg:                                   20.86
         max:                                   54.16
         95th percentile:                        0.00
         sum:                               168077.71

Threads fairness:
    events (avg/stddev):           1007.3750/7.28
    execution time (avg/stddev):   21.0097/0.01